CSI API ETABS v1
cPropFrame.GetConcreteBox Method
 Retrieves frame section property data for a concrete box frame section.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetConcreteBox(
	string Name,
	ref string FileName,
	ref string MatProp,
	ref double T3,
	ref double T2,
	ref double Tf,
	ref double Tw,
	ref int Color,
	ref string Notes,
	ref string GUID
)
Function GetConcreteBox (
	Name As String,
	ByRef FileName As String,
	ByRef MatProp As String,
	ByRef T3 As Double,
	ByRef T2 As Double,
	ByRef Tf As Double,
	ByRef Tw As Double,
	ByRef Color As Integer,
	ByRef Notes As String,
	ByRef GUID As String
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim FileName As String
Dim MatProp As String
Dim T3 As Double
Dim T2 As Double
Dim Tf As Double
Dim Tw As Double
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetConcreteBox(Name,
	FileName, MatProp, T3, T2, Tf, Tw, Color,
	Notes, GUID)
int GetConcreteBox(
	String^ Name,
	String^% FileName,
	String^% MatProp,
	double% T3,
	double% T2,
	double% Tf,
	double% Tw,
	int% Color,
	String^% Notes,
	String^% GUID
)
abstract GetConcreteBox :
        Name : string *
        FileName : string byref *
        MatProp : string byref *
        T3 : float byref *
        T2 : float byref *
        Tf : float byref *
        Tw : float byref *
        Color : int byref *
        Notes : string byref *
        GUID : string byref -> int
Parameters
Name
Type: System.String
The name of an existing frame section property.
FileName
Type: System.String
If the section property was imported from a property file, this is the name of that file. If the section property was not imported, this item is blank.
MatProp
Type: System.String
The name of the material property for the section.
T3
Type: System.Double
The section depth. [L]
T2
Type: System.Double
The section width. [L]
Tf
Type: System.Double
The flange thickness. [L]
Tw
Type: System.Double
The web thickness. [L]
Color
Type: System.Int32
The display color assigned to the section.
Notes
Type: System.String
The notes, if any, assigned to the section.
GUID
Type: System.String
The GUID (global unique identifier), if any, assigned to the section.
Return Value
Type: Int32
returns zero if the section property data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim Name As String
       Dim FileName As String
       Dim MatProp As String
       Dim t3 As Double
       Dim t2 As Double
       Dim tf As Double
       Dim tw As Double
       Dim Color As Integer
       Dim Notes As String
       Dim GUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new frame section property
       ret = SapModel.PropFrame.SetConcreteBox("BOX1", "4000Psi", 30, 36, 8, 7)
   'get frame section property data
       ret = SapModel.PropFrame.GetConcreteBox("BOX1", FileName, MatProp, t3, t2, tf, tw, Color, Notes, GUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace